## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_user_assigned_identity.uami will be created
  + resource "azurerm_user_assigned_identity" "uami" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "uami-aztf-log-prod-ne-02"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-aztf-logging-prod-ne-02"
      + tenant_id           = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>